# Чтобы запустить программный код, используйте следующую команду в терминале
# python name_file.py
# Где name_file - имя вашего файла


# Объявление переменной
# ● название переменной = значение переменной (один знак равенства
# обозначает присвоение значения к переменной)
# Программный код:

# Округление числа
# Можно указать количество знаков после запятой

a = 1.43425
b = 2.2983
c = round(a * b, 5) # 3,29633

# Сокращенные операции присваивания
# Помните в C# внутри цикла for мы писали i++. Это было сокращение от i = i + 1.
# Посмотри как можно сокращать операторы присваивания в Python

iter = 2
iter += 3   # iter = iter + 3
iter -= 4   # iter = iter - 4
iter *= 5   # iter = iter * 5
iter /= 5   # iter = iter / 5
iter //= 5  # iter = iter // 5
iter %= 5   # iter = iter % 5
iter **= 5  # iter = iter ** 5